---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeight
source: html/320f0dd9-b9ad-3d13-865a-02555b33f7d8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeight Property

"Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeight { get; }
```